# İleri Seviye Birleştirme İşlemleri

In [31]:
import pandas as pd

In [32]:
df1=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],'grup':['Muhasebe','Mühendislik','İmalat','IK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse       İmalat
3      Fatma           IK

In [33]:
df2=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],'ilk_giris':[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [34]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2009
2       Ayse       İmalat       2014
3      Fatma           IK       2019

In [35]:
pd.merge(df1,df2,on='calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2009
2       Ayse       İmalat       2014
3      Fatma           IK       2019

# Çoktan Teke

In [41]:
df3=pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2009
2       Ayse       İmalat       2014
3      Fatma           IK       2019

In [44]:
df4=pd.DataFrame({'grup':['Muhasebe','Mühendislik','IK'],'mudur':['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           IK  Berkcan

In [45]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Mühendislik       2009  Mustafa
2      Fatma           IK       2019  Berkcan

# Çoktan coka

In [50]:
df5=pd.DataFrame({'grup':['Muhasebe','Muhasebe','Mühendislik','Mühendislik','İK','İK'],'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yonetim

In [51]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux